from gauss import gauss
from sweep import sweep

# region Вариант 8
# region Метод Гаусса
A = [
    [-9,       0,       1,      -9,       1,       7],
    [ 1,      -5,       9,      -2,      -6,       8],
    [ 1,      -8,       9,      -3,       5,      -7],
    [ 2,      -3,       1,      -4,       4,      -9],
    [ 4,      -7,      -6,       2,       4,       1],
    [-2,      -0,      -4,       1,      -7,       7],
]

B = [
     -38,
     -14,
     196,
     128,
      62,
    -117,
]
# endregion

# region Метод прогонок
matrix = [
    [7,       2,       0,       0,       0,       0],
    [9,      -3,       5,       0,       0,       0],
    [0,      -5,       5,       5,       0,       0],
    [0,       0,       5,       4,       6,       0],
    [0,       0,       0,      -6,      -7,      -5],
    [0,       0,       0,       0,      -1,       3],
]

d = [
     23,
     78,
     65,
     31,
     11,
    -21,
]
# endregion
# endregion

if __name__ == '__main__':
    print('Метод Гаусса')
    gauss(A, B)

    print('\n')
    print('Метод прогонок')
    sweep(matrix, d)
